app/Controllers/Products.php

SELECT *
FROM `product`
---
    public function index()
    {
        echo ("Called");
        $model = new ProductModel();
        $data = $model->findAll();

SELECT *
FROM `product`
WHERE `product_name` = 'Product 2'
AND `product_id` = '2'
---
    public function login()
    {
        $model = new ProductModel();

        $product_name = $this->request->getVar('product_name');
        $product_price = $this->request->getVar('product_price');

        $response = array(
            "success" => true,
            "type" => "Field_Officer",
            "session_id" => "dfhdhdh",
            "message" => "Login Successful",
            "token" => "price " . $product_price . " name " . $product_name
        );

        $response1 = array(
            "success" => false,
            "type" => "Field_Officer",
            "session_id" => "dfhdhdh",
            "message" => "Wrong username and/or password!",
            "token" => "price " . $product_price . " name " . $product_name
        );
        $response2 = array(
            "success" => false,
            "type" => "Field_Officer",
            "session_id" => "dfhdhdh",
            "message" => "Contact the System Administrator!",
            "token" => "price " . $product_price . " name " . $product_name
        );

        $data = $model->getWhere(['product_name' => $product_name, 'product_id' => $product_price])->getResult();

SELECT *
FROM `product`
WHERE `product_name` = 'Product 1'
---
    public function otp()
    {
        if ($this->request->getMethod() == 'post') {
            $model = new ProductModel();
            $sms = new SMS();
            $session = session();//$session->removeTempdata('item');

            $requestBody = json_decode($this->request->getBody());
            $user = $requestBody->product_name;
            $userOTP = $requestBody->user_otp;
            $data = $model->getWhere(['product_name' => $user])->getResult();